; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v1 - type_2 ?v5 - type_3)
 	      (pred_3 ?v8 - object ?v5 - type_3)
	      (pred_4 ?v1 - type_2 ?v6 - type_1)
	      (pred_1 ?v1 - type_2 ?v8 - object ?v6 - type_1))

   (:action op_3
       :parameters  (?v1 - type_2 ?v3 ?v7 - type_3)
       :precondition (and  (pred_2 ?v1 ?v3))
       :effect (and  (pred_2 ?v1 ?v7)
		     (not (pred_2 ?v1 ?v3))))

   (:action op_1
       :parameters (?v1 - type_2 ?v2 - object ?v4 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_3 ?v2 ?v4) (pred_2 ?v1 ?v4) (pred_4 ?v1 ?v6))
       :effect (and (pred_1 ?v1 ?v2 ?v6)
		    (not (pred_3 ?v2 ?v4)) 
		    (not (pred_4 ?v1 ?v6))))

   (:action op_2
       :parameters (?v1 - type_2 ?v2 - object ?v4 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v2 ?v6) (pred_2 ?v1 ?v4))
       :effect (and (pred_3 ?v2 ?v4)
		    (pred_4 ?v1 ?v6)
		    (not (pred_1 ?v1 ?v2 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_07 - type_2
obj_06 obj_12 obj_13 obj_09 - type_1
obj_04 obj_08 obj_05 obj_10 - type_3
obj_01 obj_14 obj_03 obj_11 - object)
(:init
(pred_2 obj_02 obj_05)
(pred_4 obj_02 obj_06)
(pred_4 obj_02 obj_12)
(pred_2 obj_07 obj_08)
(pred_4 obj_07 obj_13)
(pred_4 obj_07 obj_09)
(pred_3 obj_01 obj_10)
(pred_3 obj_14 obj_04)
(pred_3 obj_03 obj_05)
(pred_3 obj_11 obj_10)
)
(:goal
(and
(pred_3 obj_01 obj_04)
(pred_3 obj_14 obj_05)
(pred_3 obj_03 obj_05)
(pred_3 obj_11 obj_05)
)
)

(:constraints
  (always (not (pred_2 obj_02 obj_10)))
)
)

; plan
1. (op_3 obj_02 obj_05 obj_04)
   deleted: (pred_2 obj_02 obj_05)
   added: (pred_2 obj_02 obj_04)
   goals met: 1 of 4
2. (op_3 obj_07 obj_08 obj_05)
   deleted: (pred_2 obj_07 obj_08)
   added: (pred_2 obj_07 obj_05)
   goals met: 1 of 4
3. (op_1 obj_02 obj_14 obj_04 obj_12)
   deleted: (pred_3 obj_14 obj_04) (pred_4 obj_02 obj_12)
   added: (pred_1 obj_02 obj_14 obj_12)
   goals met: 1 of 4
4. (op_3 obj_07 obj_05 obj_10)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_10)
   goals met: 1 of 4
5. (op_3 obj_02 obj_04 obj_05)
   deleted: (pred_2 obj_02 obj_04)
   added: (pred_2 obj_02 obj_05)
   goals met: 1 of 4
6. (op_1 obj_07 obj_11 obj_10 obj_09)
   deleted: (pred_3 obj_11 obj_10) (pred_4 obj_07 obj_09)
   added: (pred_1 obj_07 obj_11 obj_09)
   goals met: 1 of 4
7. (op_1 obj_07 obj_01 obj_10 obj_13)
   deleted: (pred_3 obj_01 obj_10) (pred_4 obj_07 obj_13)
   added: (pred_1 obj_07 obj_01 obj_13)
   goals met: 1 of 4
8. (op_2 obj_02 obj_14 obj_05 obj_12)
   deleted: (pred_1 obj_02 obj_14 obj_12)
   added: (pred_3 obj_14 obj_05) (pred_4 obj_02 obj_12)
   goals met: 2 of 4
9. (op_3 obj_07 obj_10 obj_05)
   deleted: (pred_2 obj_07 obj_10)
   added: (pred_2 obj_07 obj_05)
   goals met: 2 of 4
10. (op_2 obj_07 obj_11 obj_05 obj_09)
   deleted: (pred_1 obj_07 obj_11 obj_09)
   added: (pred_3 obj_11 obj_05) (pred_4 obj_07 obj_09)
   goals met: 3 of 4
11. (op_3 obj_07 obj_05 obj_04)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_04)
   goals met: 3 of 4
12. (op_2 obj_07 obj_01 obj_04 obj_13)
   deleted: (pred_1 obj_07 obj_01 obj_13)
   added: (pred_3 obj_01 obj_04) (pred_4 obj_07 obj_13)
   goals met: 4 of 4
